LCAD-UFES/carmen_lcad/sharedlib/OpenJAUS/ojFoxDriver/SENT/docs/src/h/p33EV256GM106.h
extern volatile C1RXF13EIDBITS C1RXF13EIDbits __attribute__((__sfr__));

#define C1RXF14SID C1RXF14SID
extern volatile unsigned int  C1RXF14SID __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF14SIDBITS {
  union {
    struct {
      unsigned EID16:1;
      unsigned EID17:1;
      unsigned :1;
      unsigned EXIDE:1;
      unsigned :1;
      unsigned SID0:1;
      unsigned SID1:1;
      unsigned SID2:1;
      unsigned SID3:1;
      unsigned SID4:1;
      unsigned SID5:1;
      unsigned SID6:1;
      unsigned SID7:1;
      unsigned SID8:1;
      unsigned SID9:1;
      unsigned SID10:1;
    };
    struct {
      unsigned EID:2;
      unsigned :3;
      unsigned SID:11;
    };
  };
} C1RXF14SIDBITS;
extern volatile C1RXF14SIDBITS C1RXF14SIDbits __attribute__((__sfr__));

#define C1RXF14EID C1RXF14EID
extern volatile unsigned int  C1RXF14EID __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF14EIDBITS {
  union {
    struct {
      unsigned EID0:1;
      unsigned EID1:1;
      unsigned EID2:1;
      unsigned EID3:1;
      unsigned EID4:1;
      unsigned EID5:1;
      unsigned EID6:1;
      unsigned EID7:1;
      unsigned EID8:1;
      unsigned EID9:1;
      unsigned EID10:1;
      unsigned EID11:1;
      unsigned EID12:1;
      unsigned EID13:1;
      unsigned EID14:1;
      unsigned EID15:1;
    };
    struct {
      unsigned EID:16;
    };
  };
} C1RXF14EIDBITS;
extern volatile C1RXF14EIDBITS C1RXF14EIDbits __attribute__((__sfr__));

#define C1RXF15SID C1RXF15SID
extern volatile unsigned int  C1RXF15SID __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF15SIDBITS {
  union {
    struct {
      unsigned EID16:1;
      unsigned EID17:1;
      unsigned :1;
      unsigned EXIDE:1;
      unsigned :1;
      unsigned SID0:1;
      unsigned SID1:1;
      unsigned SID2:1;
      unsigned SID3:1;
      unsigned SID4:1;
      unsigned SID5:1;
      unsigned SID6:1;
      unsigned SID7:1;
      unsigned SID8:1;
      unsigned SID9:1;
      unsigned SID10:1;
    };
    struct {
      unsigned EID:2;
      unsigned :3;
      unsigned SID:11;
    };
  };
} C1RXF15SIDBITS;
extern volatile C1RXF15SIDBITS C1RXF15SIDbits __attribute__((__sfr__));

#define C1RXF15EID C1RXF15EID
extern volatile unsigned int  C1RXF15EID __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF15EIDBITS {
  union {
    struct {
      unsigned EID0:1;
      unsigned EID1:1;
      unsigned EID2:1;
      unsigned EID3:1;
      unsigned EID4:1;
      unsigned EID5:1;
      unsigned EID6:1;
      unsigned EID7:1;
      unsigned EID8:1;
      unsigned EID9:1;
      unsigned EID10:1;
      unsigned EID11:1;
      unsigned EID12:1;
      unsigned EID13:1;
      unsigned EID14:1;
      unsigned EID15:1;
    };
    struct {
      unsigned EID:16;
    };
  };
} C1RXF15EIDBITS;
extern volatile C1RXF15EIDBITS C1RXF15EIDbits __attribute__((__sfr__));

#define SENT1CON1 SENT1CON1
extern volatile unsigned int  SENT1CON1 __attribute__((__sfr__));
typedef struct tagSENT1CON1BITS {
  unsigned NIBCNT:3;
  unsigned :1;
  unsigned PS:1;
  unsigned :1;
  unsigned SPCEN:1;
  unsigned PPP:1;
  unsigned CRCEN:1;
  unsigned TXPOL:1;
  unsigned TXM:1;
  unsigned RCVEN:1;
  unsigned :1;
  unsigned SNTSIDL:1;
  unsigned :1;
  unsigned SNTEN:1;
} SENT1CON1BITS;
extern volatile SENT1CON1BITS SENT1CON1bits __attribute__((__sfr__));

#define SENT1CON2 SENT1CON2
extern volatile unsigned int  SENT1CON2 __attribute__((__sfr__));
#define SENT1CON3 SENT1CON3
extern volatile unsigned int  SENT1CON3 __attribute__((__sfr__));
#define SENT1STAT SENT1STAT
extern volatile unsigned int  SENT1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT1STATBITS {
  union {
    struct {
      unsigned SYNC:1;
      unsigned RXIDLE:1;
      unsigned FRMERR:1;
      unsigned CRCERR:1;
      unsigned NIB:3;
      unsigned PAUSE:1;
    };
    struct {
      unsigned TXEN:1;
    };
    struct {
      unsigned :4;
      unsigned NIB0:1;
      unsigned NIB1:1;
      unsigned NIB2:1;
    };
  };
} SENT1STATBITS;
extern volatile SENT1STATBITS SENT1STATbits __attribute__((__sfr__));

#define SENT1SYNC SENT1SYNC
extern volatile unsigned int  SENT1SYNC __attribute__((__sfr__));
#define SENT1DATL SENT1DATL
extern volatile unsigned int  SENT1DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATLBITS {
  union {
    struct {
      unsigned CRC:4;
      unsigned DATA6:4;
      unsigned DATA5:4;
      unsigned DATA4:4;
    };
    struct {
      unsigned CRC0:1;
      unsigned CRC1:1;
      unsigned CRC2:1;
      unsigned CRC3:1;
      unsigned DATA60:1;
      unsigned DATA61:1;
      unsigned DATA62:1;
      unsigned DATA63:1;
      unsigned DATA50:1;
      unsigned DATA51:1;
      unsigned DATA52:1;
      unsigned DATA53:1;
      unsigned DATA40:1;
      unsigned DATA41:1;
      unsigned DATA42:1;
      unsigned DATA43:1;
    };
  };
} SENT1DATLBITS;
extern volatile SENT1DATLBITS SENT1DATLbits __attribute__((__sfr__));

#define SENT1DATH SENT1DATH
extern volatile unsigned int  SENT1DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATHBITS {
  union {
    struct {
      unsigned DATA3:4;
      unsigned DATA2:4;
      unsigned DATA1:4;
      unsigned STAT:4;
    };
    struct {
      unsigned DATA30:1;
      unsigned DATA31:1;
      unsigned DATA32:1;
      unsigned DATA33:1;
      unsigned DATA20:1;
      unsigned DATA21:1;
      unsigned DATA22:1;
      unsigned DATA23:1;
      unsigned DATA10:1;
      unsigned DATA11:1;
      unsigned DATA12:1;
      unsigned DATA13:1;
      unsigned STAT0:1;
      unsigned STAT1:1;
      unsigned STAT2:1;
      unsigned STAT3:1;
    };
  };
} SENT1DATHBITS;
extern volatile SENT1DATHBITS SENT1DATHbits __attribute__((__sfr__));

#define SENT2CON1 SENT2CON1
extern volatile unsigned int  SENT2CON1 __attribute__((__sfr__));
typedef struct tagSENT2CON1BITS {
  unsigned NIBCNT:3;
  unsigned :1;
  unsigned PS:1;
  unsigned :1;
  unsigned SPCEN:1;
  unsigned PPP:1;
  unsigned CRCEN:1;
  unsigned TXPOL:1;
  unsigned TXM:1;
  unsigned RCVEN:1;
  unsigned :1;
  unsigned SNTSIDL:1;
  unsigned :1;
  unsigned SNTEN:1;
} SENT2CON1BITS;
extern volatile SENT2CON1BITS SENT2CON1bits __attribute__((__sfr__));

#define SENT2CON2 SENT2CON2
extern volatile unsigned int  SENT2CON2 __attribute__((__sfr__));
#define SENT2CON3 SENT2CON3
extern volatile unsigned int  SENT2CON3 __attribute__((__sfr__));
#define SENT2STAT SENT2STAT
extern volatile unsigned int  SENT2STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT2STATBITS {
  union {
    struct {
      unsigned SYNC:1;
      unsigned RXIDLE:1;
      unsigned FRMERR:1;
      unsigned CRCERR:1;
      unsigned NIB:3;
      unsigned PAUSE:1;
    };
    struct {
      unsigned TXEN:1;
    };
    struct {
      unsigned :4;
      unsigned NIB0:1;
      unsigned NIB1:1;
      unsigned NIB2:1;
    };
  };
} SENT2STATBITS;
extern volatile SENT2STATBITS SENT2STATbits __attribute__((__sfr__));

#define SENT2SYNC SENT2SYNC
extern volatile unsigned int  SENT2SYNC __attribute__((__sfr__));
#define SENT2DATL SENT2DATL
extern volatile unsigned int  SENT2DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATLBITS {
  union {
    struct {
      unsigned CRC:4;
      unsigned DATA6:4;
      unsigned DATA5:4;
      unsigned DATA4:4;
    };
    struct {
      unsigned CRC0:1;
      unsigned CRC1:1;
      unsigned CRC2:1;
      unsigned CRC3:1;
      unsigned DATA60:1;
      unsigned DATA61:1;
      unsigned DATA62:1;
      unsigned DATA63:1;
      unsigned DATA50:1;
      unsigned DATA51:1;
      unsigned DATA52:1;
      unsigned DATA53:1;
      unsigned DATA40:1;
      unsigned DATA41:1;
      unsigned DATA42:1;
      unsigned DATA43:1;
    };
  };
} SENT2DATLBITS;
extern volatile SENT2DATLBITS SENT2DATLbits __attribute__((__sfr__));

#define SENT2DATH SENT2DATH
extern volatile unsigned int  SENT2DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATHBITS {
  union {
    struct {
      unsigned DATA3:4;
      unsigned DATA2:4;
      unsigned DATA1:4;
      unsigned STAT:4;
    };
    struct {
      unsigned DATA30:1;
      unsigned DATA31:1;
      unsigned DATA32:1;
      unsigned DATA33:1;
      unsigned DATA20:1;
      unsigned DATA21:1;
      unsigned DATA22:1;
      unsigned DATA23:1;
      unsigned DATA10:1;
      unsigned DATA11:1;
      unsigned DATA12:1;
      unsigned DATA13:1;
      unsigned STAT0:1;
      unsigned STAT1:1;
      unsigned STAT2:1;
      unsigned STAT3:1;
    };
  };
} SENT2DATHBITS;
extern volatile SENT2DATHBITS SENT2DATHbits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile unsigned int  RPOR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR0BITS {
  union {
    struct {
      unsigned RP20R:6;
      unsigned :2;
      unsigned RP35R:6;
    };
    struct {
      unsigned RP20R0:1;
      unsigned RP20R1:1;
      unsigned RP20R2:1;
      unsigned RP20R3:1;
      unsigned RP20R4:1;
      unsigned RP20R5:1;
      unsigned :2;
      unsigned RP35R0:1;
      unsigned RP35R1:1;
      unsigned RP35R2:1;
      unsigned RP35R3:1;
      unsigned RP35R4:1;
      unsigned RP35R5:1;
    };
  };
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile unsigned int  RPOR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR1BITS {
  union {
    struct {
      unsigned RP36R:6;
      unsigned :2;
      unsigned RP37R:6;
    };
    struct {
      unsigned RP36R0:1;
      unsigned RP36R1:1;
      unsigned RP36R2:1;
      unsigned RP36R3:1;
      unsigned RP36R4:1;
      unsigned RP36R5:1;
      unsigned :2;
      unsigned RP37R0:1;
      unsigned RP37R1:1;
      unsigned RP37R2:1;
      unsigned RP37R3:1;
      unsigned RP37R4:1;
      unsigned RP37R5:1;
    };
  };
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile unsigned int  RPOR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR2BITS {
  union {
    struct {
      unsigned RP38R:6;
      unsigned :2;
      unsigned RP39R:6;
    };
    struct {
      unsigned RP38R0:1;
      unsigned RP38R1:1;
      unsigned RP38R2:1;
      unsigned RP38R3:1;
      unsigned RP38R4:1;
      unsigned RP38R5:1;
      unsigned :2;
      unsigned RP39R0:1;
      unsigned RP39R1:1;
      unsigned RP39R2:1;
      unsigned RP39R3:1;
      unsigned RP39R4:1;
      unsigned RP39R5:1;
    };
  };
} RPOR2BITS;
