LCAD-UFES/carmen_lcad/sharedlib/OpenJAUS/ojFoxDriver/SENT/docs/src/h/p33EV256GM106.h
#define RPINR37 RPINR37
extern volatile unsigned int  RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      unsigned :8;
      unsigned SYNCI1R:8;
    };
    struct {
      unsigned :8;
      unsigned SYNCI1R0:1;
      unsigned SYNCI1R1:1;
      unsigned SYNCI1R2:1;
      unsigned SYNCI1R3:1;
      unsigned SYNCI1R4:1;
      unsigned SYNCI1R5:1;
      unsigned SYNCI1R6:1;
      unsigned SYNCI1R7:1;
    };
  };
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define RPINR38 RPINR38
extern volatile unsigned int  RPINR38 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR38BITS {
  union {
    struct {
      unsigned :8;
      unsigned DTCMP1R:8;
    };
    struct {
      unsigned :8;
      unsigned DTCMP1R0:1;
      unsigned DTCMP1R1:1;
      unsigned DTCMP1R2:1;
      unsigned DTCMP1R3:1;
      unsigned DTCMP1R4:1;
      unsigned DTCMP1R5:1;
      unsigned DTCMP1R6:1;
      unsigned DTCMP1R7:1;
    };
  };
} RPINR38BITS;
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR39 RPINR39
extern volatile unsigned int  RPINR39 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR39BITS {
  union {
    struct {
      unsigned DTCMP2R:8;
      unsigned DTCMP3R:8;
    };
    struct {
      unsigned DTCMP2R0:1;
      unsigned DTCMP2R1:1;
      unsigned DTCMP2R2:1;
      unsigned DTCMP2R3:1;
      unsigned DTCMP2R4:1;
      unsigned DTCMP2R5:1;
      unsigned DTCMP2R6:1;
      unsigned DTCMP2R7:1;
      unsigned DTCMP3R0:1;
      unsigned DTCMP3R1:1;
      unsigned DTCMP3R2:1;
      unsigned DTCMP3R3:1;
      unsigned DTCMP3R4:1;
      unsigned DTCMP3R5:1;
      unsigned DTCMP3R6:1;
      unsigned DTCMP3R7:1;
    };
  };
} RPINR39BITS;
extern volatile RPINR39BITS RPINR39bits __attribute__((__sfr__));

#define RPINR44 RPINR44
extern volatile unsigned int  RPINR44 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR44BITS {
  union {
    struct {
      unsigned :8;
      unsigned SENT1R:8;
    };
    struct {
      unsigned :8;
      unsigned SENT1R0:1;
      unsigned SENT1R1:1;
      unsigned SENT1R2:1;
      unsigned SENT1R3:1;
      unsigned SENT1R4:1;
      unsigned SENT1R5:1;
      unsigned SENT1R6:1;
      unsigned SENT1R7:1;
    };
  };
} RPINR44BITS;
extern volatile RPINR44BITS RPINR44bits __attribute__((__sfr__));

#define RPINR45 RPINR45
extern volatile unsigned int  RPINR45 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR45BITS {
  union {
    struct {
      unsigned SENT2R:8;
    };
    struct {
      unsigned SENT2R0:1;
      unsigned SENT2R1:1;
      unsigned SENT2R2:1;
      unsigned SENT2R3:1;
      unsigned SENT2R4:1;
      unsigned SENT2R5:1;
      unsigned SENT2R6:1;
      unsigned SENT2R7:1;
    };
  };
} RPINR45BITS;
extern volatile RPINR45BITS RPINR45bits __attribute__((__sfr__));

#define DMTCON DMTCON
extern volatile unsigned int  DMTCON __attribute__((__sfr__));
typedef struct tagDMTCONBITS {
  unsigned :15;
  unsigned ON:1;
} DMTCONBITS;
extern volatile DMTCONBITS DMTCONbits __attribute__((__sfr__));

#define DMTPRECLR DMTPRECLR
extern volatile unsigned int  DMTPRECLR __attribute__((__sfr__));
typedef struct tagDMTPRECLRBITS {
  unsigned :8;
  unsigned STEP1:8;
} DMTPRECLRBITS;
extern volatile DMTPRECLRBITS DMTPRECLRbits __attribute__((__sfr__));

#define DMTCLR DMTCLR
extern volatile unsigned int  DMTCLR __attribute__((__sfr__));
typedef struct tagDMTCLRBITS {
  unsigned STEP2:8;
} DMTCLRBITS;
extern volatile DMTCLRBITS DMTCLRbits __attribute__((__sfr__));

#define DMTSTAT DMTSTAT
extern volatile unsigned int  DMTSTAT __attribute__((__sfr__));
typedef struct tagDMTSTATBITS {
  unsigned WINOPN:1;
  unsigned :4;
  unsigned DMTEVENT:1;
  unsigned BAD2:1;
  unsigned BAD1:1;
} DMTSTATBITS;
extern volatile DMTSTATBITS DMTSTATbits __attribute__((__sfr__));

#define DMTCNTL DMTCNTL
extern volatile unsigned int  DMTCNTL __attribute__((__sfr__));
#define DMTCNTH DMTCNTH
extern volatile unsigned int  DMTCNTH __attribute__((__sfr__));
#define DMTHOLDREG DMTHOLDREG
extern volatile unsigned int  DMTHOLDREG __attribute__((__sfr__));
#define DMTPSCNTL DMTPSCNTL
extern volatile unsigned int  DMTPSCNTL __attribute__((__sfr__));
#define DMTPSCNTH DMTPSCNTH
extern volatile unsigned int  DMTPSCNTH __attribute__((__sfr__));
#define DMTPSINTVL DMTPSINTVL
extern volatile unsigned int  DMTPSINTVL __attribute__((__sfr__));
#define DMTPSINTVH DMTPSINTVH
extern volatile unsigned int  DMTPSINTVH __attribute__((__sfr__));
#define NVMCON NVMCON
extern volatile unsigned int  NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      unsigned NVMOP:4;
      unsigned :4;
      unsigned URERR:1;
      unsigned RPDF:1;
      unsigned :2;
      unsigned NVMSIDL:1;
      unsigned WRERR:1;
      unsigned WREN:1;
      unsigned WR:1;
    };
    struct {
      unsigned NVMOP0:1;
      unsigned NVMOP1:1;
      unsigned NVMOP2:1;
      unsigned NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile unsigned int  NVMADR __attribute__((__sfr__));
#define NVMADRU NVMADRU
extern volatile unsigned int  NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  unsigned NVMADRU:8;
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile unsigned int  NVMKEY __attribute__((__sfr__));
#define NVMSRCADRL NVMSRCADRL
extern volatile unsigned int  NVMSRCADRL __attribute__((__sfr__));
#define NVMSRCADRH NVMSRCADRH
extern volatile unsigned int  NVMSRCADRH __attribute__((__sfr__));
typedef struct tagNVMSRCADRHBITS {
  unsigned NVMSRCADRH:8;
} NVMSRCADRHBITS;
extern volatile NVMSRCADRHBITS NVMSRCADRHbits __attribute__((__sfr__));

#define RCON RCON
extern volatile unsigned int  RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  unsigned POR:1;
  unsigned BOR:1;
  unsigned IDLE:1;
  unsigned SLEEP:1;
  unsigned WDTO:1;
  unsigned SWDTEN:1;
  unsigned SWR:1;
  unsigned EXTR:1;
  unsigned VREGS:1;
  unsigned CM:1;
  unsigned :1;
  unsigned VREGSF:1;
  unsigned :2;
  unsigned IOPUWR:1;
  unsigned TRAPR:1;
} RCONBITS;
