LCAD-UFES/carmen_lcad/sharedlib/OpenJAUS/ojFoxDriver/SENT/docs/src/h/p33EV256GM106.h
/* RPOR7 */
#define _RP56R RPOR7bits.RP56R
#define _RP57R RPOR7bits.RP57R
#define _RP56R0 RPOR7bits.RP56R0
#define _RP56R1 RPOR7bits.RP56R1
#define _RP56R2 RPOR7bits.RP56R2
#define _RP56R3 RPOR7bits.RP56R3
#define _RP56R4 RPOR7bits.RP56R4
#define _RP56R5 RPOR7bits.RP56R5
#define _RP57R0 RPOR7bits.RP57R0
#define _RP57R1 RPOR7bits.RP57R1
#define _RP57R2 RPOR7bits.RP57R2
#define _RP57R3 RPOR7bits.RP57R3
#define _RP57R4 RPOR7bits.RP57R4
#define _RP57R5 RPOR7bits.RP57R5

/* RPOR8 */
#define _RP69R RPOR8bits.RP69R
#define _RP70R RPOR8bits.RP70R
#define _RP69R0 RPOR8bits.RP69R0
#define _RP69R1 RPOR8bits.RP69R1
#define _RP69R2 RPOR8bits.RP69R2
#define _RP69R3 RPOR8bits.RP69R3
#define _RP69R4 RPOR8bits.RP69R4
#define _RP69R5 RPOR8bits.RP69R5
#define _RP70R0 RPOR8bits.RP70R0
#define _RP70R1 RPOR8bits.RP70R1
#define _RP70R2 RPOR8bits.RP70R2
#define _RP70R3 RPOR8bits.RP70R3
#define _RP70R4 RPOR8bits.RP70R4
#define _RP70R5 RPOR8bits.RP70R5

/* RPOR9 */
#define _RP97R RPOR9bits.RP97R
#define _RP118R RPOR9bits.RP118R
#define _RP97R0 RPOR9bits.RP97R0
#define _RP97R1 RPOR9bits.RP97R1
#define _RP97R2 RPOR9bits.RP97R2
#define _RP97R3 RPOR9bits.RP97R3
#define _RP97R4 RPOR9bits.RP97R4
#define _RP97R5 RPOR9bits.RP97R5
#define _RP118R0 RPOR9bits.RP118R0
#define _RP118R1 RPOR9bits.RP118R1
#define _RP118R2 RPOR9bits.RP118R2
#define _RP118R3 RPOR9bits.RP118R3
#define _RP118R4 RPOR9bits.RP118R4
#define _RP118R5 RPOR9bits.RP118R5

/* RPOR10 */
#define _RP120R RPOR10bits.RP120R
#define _RP176R RPOR10bits.RP176R
#define _RP120R0 RPOR10bits.RP120R0
#define _RP120R1 RPOR10bits.RP120R1
#define _RP120R2 RPOR10bits.RP120R2
#define _RP120R3 RPOR10bits.RP120R3
#define _RP120R4 RPOR10bits.RP120R4
#define _RP120R5 RPOR10bits.RP120R5
#define _RP176R0 RPOR10bits.RP176R0
#define _RP176R1 RPOR10bits.RP176R1
#define _RP176R2 RPOR10bits.RP176R2
#define _RP176R3 RPOR10bits.RP176R3
#define _RP176R4 RPOR10bits.RP176R4
#define _RP176R5 RPOR10bits.RP176R5

/* RPOR11 */
#define _RP177R RPOR11bits.RP177R
#define _RP178R RPOR11bits.RP178R
#define _RP177R0 RPOR11bits.RP177R0
#define _RP177R1 RPOR11bits.RP177R1
#define _RP177R2 RPOR11bits.RP177R2
#define _RP177R3 RPOR11bits.RP177R3
#define _RP177R4 RPOR11bits.RP177R4
#define _RP177R5 RPOR11bits.RP177R5
#define _RP178R0 RPOR11bits.RP178R0
#define _RP178R1 RPOR11bits.RP178R1
#define _RP178R2 RPOR11bits.RP178R2
#define _RP178R3 RPOR11bits.RP178R3
#define _RP178R4 RPOR11bits.RP178R4
#define _RP178R5 RPOR11bits.RP178R5

/* RPOR12 */
#define _RP179R RPOR12bits.RP179R
#define _RP180R RPOR12bits.RP180R
#define _RP179R0 RPOR12bits.RP179R0
#define _RP179R1 RPOR12bits.RP179R1
#define _RP179R2 RPOR12bits.RP179R2
#define _RP179R3 RPOR12bits.RP179R3
#define _RP179R4 RPOR12bits.RP179R4
#define _RP179R5 RPOR12bits.RP179R5
#define _RP180R0 RPOR12bits.RP180R0
#define _RP180R1 RPOR12bits.RP180R1
#define _RP180R2 RPOR12bits.RP180R2
#define _RP180R3 RPOR12bits.RP180R3
#define _RP180R4 RPOR12bits.RP180R4
#define _RP180R5 RPOR12bits.RP180R5

/* RPOR13 */
#define _RP181R RPOR13bits.RP181R
#define _RP181R0 RPOR13bits.RP181R0
#define _RP181R1 RPOR13bits.RP181R1
#define _RP181R2 RPOR13bits.RP181R2
#define _RP181R3 RPOR13bits.RP181R3
#define _RP181R4 RPOR13bits.RP181R4
#define _RP181R5 RPOR13bits.RP181R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6
#define _INT1R7 RPINR0bits.INT1R7

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT2R7 RPINR1bits.INT2R7

/* RPINR2 */
#define _T1CKR RPINR2bits.T1CKR
#define _T1CKR0 RPINR2bits.T1CKR0
#define _T1CKR1 RPINR2bits.T1CKR1
#define _T1CKR2 RPINR2bits.T1CKR2
#define _T1CKR3 RPINR2bits.T1CKR3
#define _T1CKR4 RPINR2bits.T1CKR4
#define _T1CKR5 RPINR2bits.T1CKR5
#define _T1CKR6 RPINR2bits.T1CKR6
#define _T1CKR7 RPINR2bits.T1CKR7

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6
#define _T2CKR7 RPINR3bits.T2CKR7

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC1R6 RPINR7bits.IC1R6
#define _IC1R7 RPINR7bits.IC1R7
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5
#define _IC2R6 RPINR7bits.IC2R6
#define _IC2R7 RPINR7bits.IC2R7

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC3R6 RPINR8bits.IC3R6
#define _IC3R7 RPINR8bits.IC3R7
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5
#define _IC4R6 RPINR8bits.IC4R6
#define _IC4R7 RPINR8bits.IC4R7

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5
#define _OCFAR6 RPINR11bits.OCFAR6
#define _OCFAR7 RPINR11bits.OCFAR7

