LCAD-UFES/carmen_lcad/sharedlib/OpenJAUS/ojFoxDriver/SENT/docs/src/h/p33EV256GM106.h
/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**
*/


/* Register FDMTCNTH (0x2abb8)                               */

extern __attribute__((space(prog))) unsigned int _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((section("__FDMTCNTH.sec"),space(prog))) unsigned int _FDMTCNTH = (x);

/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 Bits of 32 Bit DMT Instruction Count Time-Out Value:
**
*/


/* Register FDMT (0x2abbc)                               */

extern __attribute__((space(prog))) unsigned int _FDMT;
#define _FDMT(x) __attribute__((section("__FDMT.sec"),space(prog))) unsigned int _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Enable Bit:
**     DMTEN_DISABLE        Dead Man Timer is Disabled and can be enabled by software
**     DMTEN_ENABLE         Dead Man Timer is Enabled and cannot be disabled by software
**
*/

#define DMTEN_DISABLE        0xFFFE
#define DMTEN_ENABLE         0xFFFF

/* Register FDEVOPT (0x2abc0)                               */

extern __attribute__((space(prog))) unsigned int _FDEVOPT;
#define _FDEVOPT(x) __attribute__((section("__FDEVOPT.sec"),space(prog))) unsigned int _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   PWM Lock Enable Bit:
**     PWMLOCK_OFF          PWM registers may be written without key sequence
**     PWMLOCK_ON           Certain PWM registers may only be written after key sequence
**
**   Alternate I2C1 Pins Selection Bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
*/

#define PWMLOCK_OFF          0xFFFE
#define PWMLOCK_ON           0xFFFF

#define ALTI2C1_ON           0xFFF7
#define ALTI2C1_OFF          0xFFFF

/* Register FALTREG (0x2abc4)                               */

extern __attribute__((space(prog))) unsigned int _FALTREG;
#define _FALTREG(x) __attribute__((section("__FALTREG.sec"),space(prog))) unsigned int _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 1:
**     CTXT1_IPL1           Alternate register set 1 assigned to IPL level 1
**     CTXT1_IPL2           Alternate register set 1 assigned to IPL level 2
**     CTXT1_IPL3           Alternate register set 1 assigned to IPL level 3
**     CTXT1_IPL4           Alternate register set 1 assigned to IPL level 4
**     CTXT1_IPL5           Alternate register set 1 assigned to IPL level 5
**     CTXT1_IPL6           Alternate register set 1 assigned to IPL level 6
**     CTXT1_NONE           Not Assigned
**
**   Interrupt Priority Level (IPL) Selection Bits For Alternate Working Register Set 2:
**     CTXT2_IPL1           Alternate register set 2  assigned to IPL level 1
**     CTXT2_IPL2           Alternate register set 2  assigned to IPL level 2
**     CTXT2_IPL3           Alternate register set 2  assigned to IPL level 3
**     CTXT2_IPL4           Alternate register set 2  assigned to IPL level 4
**     CTXT2_IPL5           Alternate register set 2  assigned to IPL level 5
**     CTXT2_IPL6           Alternate register set 2  assigned to IPL level 6
**     CTXT2_NONE           Not Assigned
**
*/

#define CTXT1_IPL1           0xFFF9
#define CTXT1_IPL2           0xFFFA
#define CTXT1_IPL3           0xFFFB
#define CTXT1_IPL4           0xFFFC
#define CTXT1_IPL5           0xFFFD
#define CTXT1_IPL6           0xFFFE
#define CTXT1_NONE           0xFFFF

#define CTXT2_IPL1           0xFF9F
#define CTXT2_IPL2           0xFFAF
#define CTXT2_IPL3           0xFFBF
#define CTXT2_IPL4           0xFFCF
#define CTXT2_IPL5           0xFFDF
#define CTXT2_IPL6           0xFFEF
#define CTXT2_NONE           0xFFFF

/* Register FPUD0 (0x800ff0)                               */

extern __attribute__((space(prog))) unsigned int _FPUD0;
#define _FPUD0(x) __attribute__((section("__FPUD0.sec"),space(prog))) unsigned int _FPUD0 = (x);

/*
** Only one invocation of FPUD0 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPUD0.
** Multiple options may be combined, as shown:
**
** _FPUD0( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FPUD1 (0x800ff4)                               */

extern __attribute__((space(prog))) unsigned int _FPUD1;
#define _FPUD1(x) __attribute__((section("__FPUD1.sec"),space(prog))) unsigned int _FPUD1 = (x);

/*
** Only one invocation of FPUD1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPUD1.
** Multiple options may be combined, as shown:
**
** _FPUD1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FPUD2 (0x800ff8)                               */

extern __attribute__((space(prog))) unsigned int _FPUD2;
#define _FPUD2(x) __attribute__((section("__FPUD2.sec"),space(prog))) unsigned int _FPUD2 = (x);

