LCAD-UFES/carmen_lcad/sharedlib/OpenJAUS/ojFoxDriver/SENT/docs/src/h/p33EV256GM106.h
/*
** Only one invocation of FPUD2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPUD2.
** Multiple options may be combined, as shown:
**
** _FPUD2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/


/* Register FPUD3 (0x800ffc)                               */

extern __attribute__((space(prog))) unsigned int _FPUD3;
#define _FPUD3(x) __attribute__((section("__FPUD3.sec"),space(prog))) unsigned int _FPUD3 = (x);

/*
** Only one invocation of FPUD3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPUD3.
** Multiple options may be combined, as shown:
**
** _FPUD3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/




/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x2a980

#define __FSEC_BASE 0x2ab8c
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2ab90
#define __FBSLIM_LENGTH 0x2

#define __FOSCSEL_BASE 0x2ab98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2ab9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2aba0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2aba4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2aba8
#define __FICD_LENGTH 0x2

#define __FDMTINTVL_BASE 0x2abac
#define __FDMTINTVL_LENGTH 0x2

#define __FDMTINTVH_BASE 0x2abb0
#define __FDMTINTVH_LENGTH 0x2

#define __FDMTCNTL_BASE 0x2abb4
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0x2abb8
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0x2abbc
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0x2abc0
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x2abc4
#define __FALTREG_LENGTH 0x2

#define __FPUD0_BASE 0x800ff0
#define __FPUD0_LENGTH 0x2

#define __FPUD1_BASE 0x800ff4
#define __FPUD1_LENGTH 0x2

#define __FPUD2_BASE 0x800ff8
#define __FPUD2_LENGTH 0x2

#define __FPUD3_BASE 0x800ffc
#define __FPUD3_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x4000


#endif
